Repository: Lucatiel12/Book_Hub
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Published date
ar: تاريخ النشر

source: Choose
ar: اختيار

source: Cover image
ar: صورة الغلاف

# ebookFile
source: Ebook file (pdf/epub)
ar: ملف الكتاب (PDF/EPUB)

# requiredField
source: Required
ar: مطلوب

source: Pick date
ar: اختر التاريخ

# submissionFailed
source: Failed: {errorMessage}
ar: فشل: {errorMessage}

source: Book created successfully
ar: تم انشاء الكتاب بنجاح

# categoriesFailed
source: Categories failed: {error}
ar: فشل تحميل التصنيفات: {error}

source: Submit a Book
ar: ارسال كتاب

# bookSubmittedSuccessfully
source: Book "{bookTitle}" submitted successfully!
ar: تم ارسال الكتاب "{bookTitle}" بنجاح!

source: Book Details
ar: تفاصيل الكتاب

# enterBookTitleHint
source: Enter the book title
ar: ادخل عنوان الكتاب

# pleaseEnterTitle
source: Please enter a title
ar: الرجاء ادخال عنوان

source: Author
ar: المؤلف

# enterAuthorNameHint
source: Enter the author's name
ar: ادخل اسم المؤلف

# pleaseEnterAuthor
source: Please enter an author
ar: يرجى ادخال اسم المؤلف

source: Description
ar: الوصف

# briefDescriptionHint
source: Brief description of the book...
ar: وصف موجز للكتاب...

source: PDF/ePub Link
ar: رابط PDF/ePub

# pleaseEnterLink
source: Please enter a link
ar: الرجاء ادخال رابط

source: ISBN
ar: ردمك

source: Category
ar: الفئة

# selectCategoryHint
source: Select a category
ar: اختر فئة

# pleaseSelectCategory
source: Please select a category
ar: الرجاء اختيار فئة

# submissionGuidelinesNote
source: Note: Please ensure your book link...
ar: ملاحظة: يرجى التاكد من ان رابط الكتاب صحيح...

# optionalLabel
source: (Optional)
ar: (اختياري)

source: Loading…
ar: جاري التحميل...

source: Book
ar: كتاب

source: Failed to load book
ar: فشل تحميل الكتاب

# removeFromSavedTooltip
source: Remove from Saved
ar: ازالة من المحفوظات

# saveTooltip
source: Save
ar: حفظ

# byAuthor
source: by {authorName}
ar: بقلم {authorName}

# categoryLabel
source: Category: {categoryName}
ar: الفئة: {categoryName}

source: Read Now
ar: اقرا الان

source: Remove
ar: ازالة

source: Download
ar: تحميل

source: Retry
ar: اعادة المحاولة

source: Chapters
ar: الفصول

source: About This Book
ar: حول هذا الكتاب

source: No description available
ar: لا يوجد وصف متاح

source: No description
ar: لا يوجد وصف

source: Full Book
ar: الكتاب الكامل

source: Download URL not available
ar: رابط التنزيل غير متوفر

source: Added to Downloads
ar: تمت اضافته الى التنزيلات

# bookRemovedFromDevice
source: {bookTitle} removed from device
ar: تمت ازالة {bookTitle} من الجهاز

# bookSaved
source: {bookTitle} saved!
ar: تم حفظ {bookTitle}!

# bookRemovedFromSaved
source: {bookTitle} removed from Saved
ar: تمت ازالة {bookTitle} من المحفوظات

source: Browse Categories
ar: تصفح الفئات

# bookCount
source: {count, plural, =0 {No books} one {# book} other {# books}}
ar: {count, plural, =0 {لا كتب} one {كتاب واحد} two {كتابان} few {# كتب} many {# كتابا} other {# كتاب}}

# errorGeneric
source: Error: {errorMessage}
ar: خطا: {errorMessage}

source: No downloads yet
ar: لا توجد تنزيلات بعد

source: Untitled
ar: بدون عنوان

# unknownAuthor
source: Unknown
ar: مؤلف غير معروف

source: Request a Book
ar: اطلب كتابا

# requestBookDescription
source: Can't find the book you're looking for...
ar: لا يمكنك العثور على الكتاب الذي تبحث عنه...

source: Book Title
ar: عنوان الكتاب

# enterTitleValidation
source: Enter a title
ar: ادخل عنوانا

source: Description (optional)
ar: الوصف (اختياري)

# additionalDetailsHint
source: Any additional details about the book...
ar: اي تفاصيل اضافية عن الكتاب...

# helpUsFindBook
source: Help us find the exact book...
ar: ساعدنا في العثور على الكتاب بالضبط...

source: Submit Request
ar: ارسال الطلب

# requestSubmitted
source: Request for "{bookTitle}" submitted!
ar: تم ارسال طلب "{bookTitle}"!

# requestResponseTime
source: We typically respond to book requests...
ar: نرد عادة على طلبات الكتب خلال فترة قصيرة...

source: No saved books yet
ar: لا توجد كتب محفوظة بعد

source: Removed from Saved
ar: تمت الازالة من المحفوظات

source: Failed to load details
ar: فشل تحميل التفاصيل

source: Search
ar: بحث

# searchOfflineUnavailable
source: Offline — search is unavailable
ar: غير متصل — البحث غير متاح

# searchHint
source: Search books, authors, categories…
ar: ابحث عن الكتب او المؤلفين او الفئات...

# searchingFor
source: Searching: "{query}"
ar: جاري البحث: "{query}"

# offlineMessage
source: You are offline. Try again...
ar: انت غير متصل. حاول مرة اخرى...

# searchFailed
source: Failed to search. {error}
ar: فشل البحث. {error}

source: No results. Try another keyword.
ar: لا توجد نتائج. حاول كلمة اخرى.

# paginationStatus
source: Page {currentPage} of {totalPages}
ar: صفحة {currentPage} من {totalPages}

# previous
source: Prev
ar: السابق

source: Next
ar: التالي

# searchEmptyHint
source: Search for books, authors, or categories
ar: ابحث عن كتب او مؤلفين او فئات

source: Anonymous User
ar: مستخدم مجهول

# noEmail
source: No email available
ar: لا يوجد بريد الكتروني

source: Saved
ar: المحفوظة

source: Library
ar: المكتبة

source: History
ar: السجل

source: Settings
ar: الاعدادات

source: Reading History
ar: سجل القراءة

# adminCreateBook
source: Create / Submit Book
ar: انشاء / رفع كتاب

source: Manage Requests
ar: ادارة الطلبات

source: Review Submissions
ar: مراجعة المساهمات

source: Create Book
ar: انشاء كتاب

source: Add Category
ar: اضافة فئة

source: Category name
ar: اسم الفئة

# categoryNameHint
source: e.g., Fantasy
ar: مثال: فانتازيا

source: Create
ar: انشاء

source: Cancel
ar: الغاء

# categoryCreated
source: Category "{name}" created
ar: تم انشاء الفئة "{name}"

# categoryCreateFailed
source: Failed to create category: {error}
ar: فشل انشاء الفئة: {error}

source: No categories yet
ar: لا توجد فئات بعد
